{"CONTACT":"Contact","ABOUT_US":"About us","DOWNLOADS":"Downloads","NEWS":"News","RECRUITMENT":"Recruitment","r-and-d":"R&D","SUCCESS_STORIES":"Success stories","BUSINESS":"Business","SERVICES":"Services","DEVELOPMENT_DOMAINS":"Development domains","CONTRACT_MODELS":"Contract models","CAREER":"Career","CONTACT_US":"Contact us","HANOI_OFFICE":"Head office in Hanoi:","HANOI_OFFICE_ADDRESS":"6th Floor, Sudico Building (HH3)<br>Me Tri Street, Nam Tu Liem District<br>Hanoi City, Vietnam","HANOI_REPRESENTATIVE":"Pham Thai Son","HANOI_REPRESENTATIVE_POSITION":"Chief Executive Officer","HANOI_REPRESENTATIVE_TEL":"Tel: (+84) 243 200 8754","HANOI_REPRESENTATIVE_EMAIL":"Email: son.pham@ntq-solution.com.vn","JAPAN_OFFICE":"NTQ Japan:","JAPAN_OFFICE_ADDRESS":"〒231-0001<br>6F, Yokohama World Posters Building<br>2 Chome-2-1 Shinko, Naka Ward, Yokohama, Kanagawa Prefecture, Japan","N2LAB":"N2 Lab:","N2LAB_ADDRESS":"〒106-0032<br>Tokyo to Minami ku Roppongi 4-2-35<br>Urban Style Roppongi Mikawadai 2F","JAPAN_REPRESENTATIVE":"Yoshi Ogawa","JAPAN_REPRESENTATIVE_POSITION":"NTQ Japan CEO","JAPAN_REPRESENTATIVE_TEL":"Tel: (+81) 45 228 9010","JAPAN_REPRESENTATIVE_EMAIL":"Email: yoshi.ogawa@ntq-solution.com.vn","N2LAB_REPRESENTATIVE":"Tomohiro Takase","N2LAB_REPRESENTATIVE_POSITION":"N2 Lab CEO","N2LAB_REPRESENTATIVE_TEL":"Tel: (+81) 3 5772 1414","N2LAB_REPRESENTATIVE_EMAIL":"Email: takase@nadia.bz","404_INFORM":"The page you’re looking for cannot be found","TO_HOMEPAGE":"To homepage","LANDING_HEADING":"Delivering<br>the Next Top Quality Solution","LANDING_SUB_HEADING":"Vietnam Software Outsourcing Company","DOWNLOAD_MATERIALS":"Download Materials","OFFER_MESSAGE_1":"We offer 2 man-month trial projects to showcase our abilities to you.","OFFER_MESSAGE_2":"We offer a consultancy service and are eagerly awaiting any questions, estimations or propositions that you may have.","READ_MORE":"Read more","SEE_HOW_THEY_WORK":"See how they work","r-and-d-heading":"Research & Development","r-and-d-sub-heading":"We have an extremely innovative research & development department.<br>We are currently looking for a partner who we can collaborate with and can provide support for our present, and future, projects.","OUR_PARTERNS":"Our partners","OUR_PARTNERS_SLOGAN":"NTQ Solution: We Are a Part of You","SEE_MORE_TECHNOLOGIES":"See more technologies","WHY_NTQ":"<span class=\"text-green\">Why<\/span> NTQ?","TECHNICAL_CAPABILITIES":"Technical capabilities","TECHNICAL_CAPABILITIES_DESC":"Our expert knowledge and capabilities in software development stems from our members of staff who have graduated from top universities around the world.","STRONG_RELATIONSHIPS":"STRONG RELATIONSHIPS","STRONG_RELATIONSHIPS_DESC":"While the yearly rate of employees leaving jobs is 25% per Vietnamese company, our company only loses 10% of our employees annually. This is due to our ability to facilitate a fun and rewarding environment to work in.<br>We also have strong relationships with our customers and implement bilateral communications with them to enhance project effectiveness and efficiency.","GLOBAL_PORTFOLIO":"GLOBAL PORTFOLIO","GLOBAL_PORTFOLIO_DESC":"NTQ is striving to expand our business to serve clients on a global scale. We believe that our experience in dealing with a culturally diverse portfolio of customers will enable us to serve future clients more effectively.","TECHNOLOGIES":"Technologies","TECHNOLOGIES_HEADING":"TECHNOLOGY IS THE KEY TO OUR SUCCESS","TECHNOLOGIES_SUB_HEADING":"We keep updated with the latest technologies and are continually expanding the amount of technologies we can offer our clients.","CUSTOMER_REVIEWS":"Customer reviews","MARINAX_CUSTOMER_NAME":"Satoshi Kawai","MARINAX_CUSTOMER_POSITION":"COO, Marinax Inc, Japan","MARINAX_CUSTOMER_REVIEW":"Sometimes our projects require us to create deliverables and produce documents written in English. In Japan it is hard to find engineers who can understand English, making it difficult to control costs and the speed at which a project is completed. NTQ Solution solved this problem for us through their excellent English communication skills.","ROI_CUSTOMER_NAME":"Linh Nguyen","ROI_CUSTOMER_POSITION":"Technical Manager, ROI Marketing Solutions Ltd, UK","ROI_CUSTOMER_REVIEW":"ROI Marketing Solutions Ltd has worked with NTQ Solutions to develop an online marketing application over the past year. During this time, NTQ has demonstrated good technical and communication skills over different parts of the software development cycle such requirement identification and development.","ITSHERPA_CUSTOMER_NAME":"Yusuke Akinaga","ITSHERPA_CUSTOMER_POSITION":"Account Manager, ITSherpa - Japan","ITSHERPA_CUSTOMER_REVIEW":"The staff at NTQ are very dynamic as shown in their ability to simultaneously create a fun atmosphere while being productive. In terms of quality, they have captured the Japanese psyche and have produced good software products. Nowadays, many Japanese companies are looking for foreign partners in the software industry. Our company has luckily found a good partner in NTQ Solution.","BIT2BYTE_CUSTOMER_NAME":"Asuka Inoue","BIT2BYTE_CUSTOMER_POSITION":"CEO, Bit2Byte Inc, Japan","BIT2BYTE_CUSTOMER_REVIEW":"Before doing business with NTQ I felt very worried. However, they have proven to us that they can deliver our specifications to a high standard and NTQ has now become a reliable partner of ours. I have never had a problem with communication with NTQ because they understand the Japanese language and characteristics. I am very glad to have NTQ as a partner as they can provide easy to manage services at reasonable prices.","DOMAINS":"Domains","DOMAINS_SLOGAN":"Turn your ideas into reality","SOFTWARE_OUTSOURCING":"Software Outsourcing","SOFTWARE_OUTSOURCING_DESC":"Achieve business efficiency by outsourcing a part, or the whole, of your software development projects","LEARN_MORE":"Learn more","SOLUTIONS_CONSULTANCY":"Solutions Consultancy","SOLUTIONS_CONSULTANCY_DESC":"We provide a solutions consultancy service","GRAPHIC_DESIGN":"Graphic Design","GRAPHIC_DESIGN_DESC":"Complete your software with our most trendy mobile and web app graphic design","MOBILE_APP":"Mobile App","WEB_APP":"Web App","EMBEDDED_SOFTWARE":"Embedded Software","HEALTHCARE_SOFTWARE":"Healthcare Software","SYSTEM_INTEGRATION":"System Integration","ENTERPRISE_APPLICATION":"Enterprise Application","CLOUDBASED_SOFTWARE":"Cloud-based Software","ECOMMERCE_SOFTWARE":"E-commerce Software","WHO_IS_NTQ":"<span class=\"text-green\">Who<\/span> is NTQ Solution?","WHO_IS_NTQ_DESC":"NTQ Solution is a Vietnamese software development company providing offshore development services such as mobile and web applications as well as other essential software services for businesses.","WHY_NTQ_PLAIN":"Why NTQ?","WHO_IS_NTQ_PLAIN":"Who is NTQ Solution?","DOWNLOADS_HEADING":"To discover more about NTQ Solution please feel free to download the materials listed below.<br>Check out our portfolios to explore the high quality work we have done in the past.","RELATED_NEWS":"Related news","OLDER_POSTS":"Older Posts","CONTACT_IN_HANOI":"Head office in Hanoi","CONTACT_IN_HANOI_ADDRESS":"6th Floor, Sudico Building (HH3), Me Tri Street<br>Nam Tu Liem District, Hanoi City, Vietnam","CONTACT_IN_JAPAN":"Representative in Japan","CONTACT_IN_JAPAN_ADDRESS":"〒231-0001<br>6F, Yokohama World Posters Building<br>2 Chome-2-1 Shinko, Naka Ward, Yokohama, Kanagawa Prefecture, Japan","CONTACT_DESC":"If you have any questions regarding any of our services then please feel free to contact us. We offer a consultancy service and are eagerly awaiting any questions, estimations or propositions that you may have.","NAME":"Name","EMAIL_ADDRESS":"Email address","SUBJECT":"Subject","MESSAGE_CONTENT":"Message content","ODC":"Offshore Development Center (Dedicated Team)","ODC_DESC":"The pricing strategy used in this model is based on the amount of time our development team will be contracted to a client's project.","RECOMMENDED":"This model is recommended to companies who:","ODC_RECOMMENDED_1":"Have devised specifications but plan to change or add to them throughout the project","ODC_RECOMMENDED_2":"Have not devised specifications and are looking to develop in a flexible manner","ADVANTAGES":"Advantages","ODC_ADVANTAGE_1":"Our clients have a dedicated team that are focused solely on their project","ODC_ADVANTAGE_2":"We create bilateral communications with our clients meaning information sharing is made easy throughout the duration of the project","PROJECT_BASED":"Project-Based Pricing","PROJECT_BASED_DESC":"The pricing strategy used in this model is calculated based on the effort required to complete each part of a project.","PROJECT_BASED_RECOMMENDED_1":"Have already devised clear specifications for the project","PROJECT_BASED_RECOMMENDED_2":"Plan to end the project within a short time period","PROJECT_BASED_ADVANTAGE_1":"You only need to make a one-off payment which is calculated specifically for the project","MOBILE_APPLICATION_DEVELOPMENT":"Mobile Application Development","MOBILE_APPLICATION_DEVELOPMENT_DESC":"Improve your business flexibility through Ipad\/Iphone and Android Apps","MOBILE_APPLICATION_DEVELOPMENT_EXPLAIN":"NTQ Solution has successfully completed over 50 projects in various fields such as Social Network Systems (SNS), entertainment and utility apps. Our developers all have between 3-6 years experience while our senior developers have between 7-10 years experience.<br><br>Our experience has been key to the successful completion of our client’s projects. For instance, a Spanish composer was seeking a software development company to create and app for him. His application ideas were deemed ‘impossible’ and were therefore rejected by over 50 companies before he finally found NTQ Solution.<br><br>We were able to complete this ‘impossible’ project using over 20 of our top engineers.","DOWNLOAD_IOS_PROFILE":"Download iOS profile","DOWNLOAD_ANDROID_PROFILE":"Download Android profile","MOBILE_APPLICATION_DEVELOPMENT_IOS_HEADING":"iPhone\/ iPad development – One of the most secure and stable platforms of mobile app development","MOBILE_APPLICATION_DEVELOPMENT_IOS_DESC":"Our highly qualified and experienced mobile app developers have an exceptional understanding of Apple development resources.<br>Our developers have the ability to help you from the beginning of the design process all the way through to training and advice after the product has been delivered.<br>A trial project can be arranged to allow you to see first hand our abilities before we embark on your real project.<br>We guarantee to create outstanding iPhone\/iPad applications that will make your business stand out from others.","MOBILE_APPLICATION_DEVELOPMENT_TECH":"iPhone\/iPad technologies and frameworks:","MOBILE_APPLICATION_DEVELOPMENT_ANDROID_HEADING":"Android app development - One of the most popular platforms to create stylish utility apps","MOBILE_APPLICATION_DEVELOPMENT_ANDROID_DESC":"The demand for Android applications is increasing. Android applications are essential if you want your company to reach a large number of customers besides iPhone\/iPad users.<br>Our Android developers are experts in Android application technologies and will create Android applications that will delight you and your customers.<br>We focus on improving stability and improving responsiveness of Android apps by taking care to avoid memory leaks, moving long-running operations off the main thread to worker threads, minimizing complexity of layouts, etc.","MOBILE_APPLICATION_DEVELOPMENT_ANDROID_TECH":"Android technologies and frameworks:","WEB_APPLICATION_DEVELOPMENT":"WEB APPLICATION DEVELOPMENT","WEB_APPLICATION_DEVELOPMENT_DESC":"Your expectations are delivered through every application you desire","WEB_APPLICATION_DEVELOPMENT_EXPLAIN":"Web application development is the most popular domain among our clients that have chosen our Offshore Development Contract. Currently, 60% of our engineers are part of a team that is meeting our clients web application needs.<br><br>We have developed over 40 web application projects in fields such as SNS and online services with a proven track record of completing long term projects which require many engineers. Compounded with this experience is the fact that all our web applications can be displayed on all browsers and devices.","WEB_APPLICATION_DEVELOPMENT_LANGUAGES":"The most popular programming languages for web that NTQ Solution have experience using are:","WEB_APPLICATION_DEVELOPMENT_TECH":"Popular frameworks & technologies for web user interface:","CLOUDBASED_SOFTWARE_DEVELOPMENT":"CLOUD-BASED SOFTWARE DEVELOPMENT","CLOUDBASED_SOFTWARE_DEVELOPMENT_DESC":"Make your business more effective by installing a cloud system","CLOUDBASED_SOFTWARE_DEVELOPMENT_EXPLAIN":"We are currently working on an ongoing project with Systena, a major Japanese company who are listed on the First Section of the Tokyo Stock Exchange. Systena employ us to carry out requirement definition, development, operations and maintenance of their cloud system.<br><br>Our experience has led us to become experts using Microsoft Azure, Google App Engine and other Platforms as a Service (PaaS).","ENTERPRISE_APPLICATION_DEVELOPMENT":"ENTERPRISE APPLICATION DEVELOPMENT","ENTERPRISE_APPLICATION_DEVELOPMENT_DESC":"Solve your customer's issues, adapt to unpredictable market demands and create a more efficient business","ENTERPRISE_APPLICATION_DEVELOPMENT_EXPLAIN":"So far, we have developed many enterprise applications in various fields such as finance, distribution, human resource and education. Innovative and comprehensive solutions deliver value by increasing business efficiency, enhancing workforce productivity, saving operating costs, boosting employee and customer satisfaction and providing support to make more informed decisions.","ECOMMERCE_SOFTWARE_DEVELOPMENT":"E-COMMERCE SOFTWARE DEVELOPMENT","ECOMMERCE_SOFTWARE_DEVELOPMENT_EXPLAIN":"In order to successfully develop e-commerce software, we focus on a full range of elements that relate to your online business. This includes choosing a Content Management System (CMS) to effectively manage your Blog, Articles and Press Releases as well as developing necessary features for your e-commerce business such as Marketing and Upsell features, Security, Online Payment and Performance and Scalability to manage a big volume of consumers.<br><br>We also offer you a mobile e-commerce app development when you want to access the huge number of mobile users who are using their phones to research and find products online.","HEALTHCARE_SOFTWARE_DEVELOPMENT":"HEALTHCARE SOFTWARE DEVELOPMENT","HEALTHCARE_SOFTWARE_DEVELOPMENT_DESC":"We provide better analytical results in the health-care sector","HEALTHCARE_SOFTWARE_DEVELOPMENT_EXPLAIN":"We have staff with over five years of experience working with healthcare software projects. Our Healthcare software experts have participated in a number of healthcare software projects for a leading healthcare company in Japan.<br>The applications we have worked on enable quantitative analyses of medical images due to visualization enhancement.","EMBEDDED_SOFTWARE_DEVELOPMENT":"EMBEDDED SOFTWARE AND SYSTEM DEVELOPMENT","EMBEDDED_SOFTWARE_DEVELOPMENT_DESC":"Achieve business excellence through embedded intelligence","EMBEDDED_SOFTWARE_DEVELOPMENT_EXPLAIN":"At NTQ Solution we provide a full range of embedded software development services including concept development, design and implementation due to our expertise in 8but microchip, Intelligence sensor, LPF, Kalman Filter, PID controller as well as other embedded technologies.","SYSTEM_INTEGRATION_DESC":"Combine your existing computing systems together to create one large and complete system","SYSTEM_INTEGRATION_EXPLAIN":"We will work with you to understand your business goals so we can accurately devise a way to seamlessly integrate an accelerated solution to help you meet those goals. We help businesses achieve optimal performance levels at an accelerated rate due to our service.<br><br>Our system integration engineers have a broad range of skills including software engineering and interface protocols. Our engineers have had to use their intuition and adaptability to solve problems and difficulties that arise during integration projects.","ECOMMERCE_SOFTWARE_DEVELOPMENT_DESC":"Implement e-commerce softwares to bring success to your on-line business","RESEARCH_AND_DEVELOPMENT":"Research & Development","why-r-and-d":"<span class=\"text-green\">Why<\/span> R&D?","why-r-and-d-explain":"We develop our robots from scratch and aim to make our innovative ideas come to life.","why-r-and-d-reason-1":"TO GAIN FURTHER INSIGHT INTO THE TECHNOLOGIES WE USE","why-r-and-d-reason-1-explain":"Our R&D department aim to learn more about the technology NTQ operates with in order to enhance our technological capabilities.","why-r-and-d-reason-2":"TO SUPPORT DEVELOPMENT TEAMS","why-r-and-d-reason-2-explain":"Our R&D department is not an independent department. The R&D team members are often asked to support our client’s projects. Their technological capabilities and knowledge have proven vital in the successful completion of some difficult projects.","AIR_DRONE":"Air Drone","AIR_DRONE_DESC":"This plane can fly and balance itself while streaming a live video to a computer using WiFi.","GECKO":"Window washing robot","GECKO_DESC":"This robot moves like a lizard to climb the walls of tall buildings in order to clean a skyscrapers windows.","GUIDEBOT":"GUIDEBOT","GUIDEBOT_DESC":"This robot leads visitors to the office from the main entrance.","CRAZY_TEAM":"Crazy Team","CRAZY_TEAM_DESC":"Our R&D employees are labeled the ‘Crazy Team’ due to their ability to think of innovative ideas for projects.","r-and-d-offer":"We are currently looking for partners who we can collaborate with and who can support us with our present, and future, projects.<br><br>For those interested in our R&D, feel free to contact us.","SOFTWARE_OUTSOURCING_SERVICE":"Software outsourcing service","SOFTWARE_OUTSOURCING_SERVICE_DESC":"Gain advantages by outsourcing your software development to us","SOFTWARE_OUTSOURCING_SERVICE_EXPLAIN":"NTQ Solution is always updated with the latest technologies which allows us to develop software which stands out from others. This enables our customers to compete and take advantage of economies of scale.","SOFTWARE_OUTSOURCING_SERVICE_LIST":"NTQ is here for you when:","SOFTWARE_OUTSOURCING_SERVICE_ITEM_1":"You don't have enough engineering resources","SOFTWARE_OUTSOURCING_SERVICE_ITEM_2":"No software engineers are available to work on your software development projects","SOFTWARE_OUTSOURCING_SERVICE_ITEM_3":"You want to save costs by hiring offshore software developers at reasonable rates","SOFTWARE_OUTSOURCING_SERVICE_ITEM_4":"You want to focus on your core business activities, therefore let us take care of your software development activities.","SOFTWARE_SOLUTIONS_CONSULTANCY_FOR_FREE":"SOFTWARE SOLUTIONS CONSULTANCY","SOFTWARE_SOLUTIONS_CONSULTANCY_FOR_FREE_DESC":"We offer this service to you for LOWEST COST","SOFTWARE_SOLUTIONS_CONSULTANCY_FOR_FREE_EXPLAIN":"It is not always easy to find optimal software solutions or the answers to technical questions for your current software development needs. This is especially true when your questions involve the latest technologies.<br><br>We are here to help if you have any questions related to your future software development needs.<br><br>Please contact us and let our experts support you in solving all your concerns related to technical problems, or solutions, for your software projects.","WEB_APP_GRAPHIC_DESIGN":"WEB\/APP GRAPHIC DESIGN","WEB_APP_GRAPHIC_DESIGN_DESC":"Complete your software with our most trendy mobile and web app graphic design","WEB_APP_GRAPHIC_DESIGN_EXPLAIN":"Our graphic designers have the ability to provide you with a complete software solution and development service pack which includes technical design and development as well as UI graphic design.<br><br>NTQ Solution recognizes the greater requirements that are placed on graphic design. Graphic design can bring exciting experiences for the users so our design team always strives to be as creative as possible when creating our products in order to satisfy our customers.Therefore we can guarantee to deliver quality products designed in accordance with modern trends.<br><br>Our graphic design service are for web, mobile and desktop applications.<br><br>In terms of web design, if you plan to have a web running on all screen sizes of different devices, you can request a responsive web design. Your responsive site will be easy to read or navigated with minimum resizing, panning and scrolling.<br><br>To optimize your manpower and communication time for the project, we recommend you choose the full service pack including graphic design so that we can give you a complete solution.","SYSTENA":"Systena Corporation","SYSTENA_DESC":"Development of a cloud system for Systena Corporation from Japan","SYSTENA_EXPLAIN":"Systena Corporation is a Japanese IT company listed in the First Section of the Tokyo Stock Exchange and was founded in 1983. This company covers business areas such as service solutions, quality designs, framework designs, cloud systems and so on. Systena Corporation was looking to extend their offshoring business and therefore proceeded to approach NTQ Solution.","THE_CHANLLENGE":"The challenges","SYSTENA_CHANLLENGE_1":"The first challenge was a technical requirement. We had to create a cloud system which was compatible with 100,000 users and 20,000 heavy accesses. Moreover, this system had to be compatible with Google services and each screen had to be dealt with within 1 second.","SYSTENA_CHANLLENGE_2":"The second challenge was how to maintain existing systems.","COMPETITION":"Competition","SYSTENA_COMPETITION":"There were 5 competitors including our company.","SOLUTION":"Solution","SYSTENA_SOLUTION":"We utilized cloud-based infrastructure such as AWS EC2, RDS, ElasticCache, ElasticBalancer and so on. Also, we improved performance using Redis and dealt with heavy traffic integrating NodeJS and Java.","RESULT":"Result","SYSTENA_RESULT":"The only company which successfully ended the pilot project was NTQ Solution. Thanks to this achievement, Systena Corporation has ordered more projects using our services. Although we began to do business with a 1-man-month project, we are now managing a 10-man-month project.  In development filed, our company is in charge of almost all parts of development such as designs, technology, join tests, solutions, measure and in charge of all the projects of cloud system development from Systena Corporation.","ROI":"ROI MARKETING SOLUTION","ROI_DESC":"Development of “Personalized marketing materials system” for ROI Marketing Solutions from UK.","ROI_EXPLAIN":"ROI Marketing Solutions is a leading provider of web to print, variable data publishing and cross media software. They are based in the UK and have helped over 500 print providers, agencies and marketing departments to secure new business and customer loyalty as well as improve operational efficiency. Companies they have helped in the past include Perivan Solutions, Platinum Print, Northend Creative Print and Creazy.","ROI_CHANLLENGE_1":"ROI marketing solutions owns a personalized marketing materials system which provides a comprehensive list of 37 million UK consumers and in-depth information for marketing purposes. Users of the system are business owners or marketers.","ROI_CHANLLENGE_2":"With a huge number of data, the existing system was very slow in returning search results to users (2 to 10 minutes). ROI marketing solutions by that time was therefore seeking a software company who could assess their existing system and improve the performance.","ROI_COMPETITION":"NTQ Solution had to compete with 6 other companies: 5 companies from Vietnam and 1 company from the Czech republic.","ROI_SOLUTION":"NTQ Solution built our own complicated algorithms based on bitwise operators. More specifically we moved all data and store them in memory, implemented indexing for faster queries, after that we processed the data in bit-wise operators. And to improve disk I\/O performance, simple cache file mechanics was implemented.","ROI_RESULT":"We completed the challenge by obtaining a speed of between 0.1-0.5 seconds from the time a search request was made to the results for that request appearing for the customer.<br>The results impressed customers as all other competitors produced slower systems. Thanks to that, NTQ Solution was selected and has been collaborating with ROI Marketing Solutions for a long period of time in the current OSDC contract.","LEARN_MORE_ABOUT_OUR_PROJECTS":"Learn more about our projects","IT_SHERPA":"IT SHERPA LTD","IT_SHERPA_DESC":"Development of a mobile social network system (SNS) for IT Sherpa Ltd a Japanese Company.","IT_SHERPA_EXPLAIN":"IT Sherpa is a software company based in Japan and was established in 2000. Their main focus is providing internet solutions, hosting & system consulting service, ASP (Application service provider) service and mobile\/smartphone application development. NTQ Solution participated in a business matching conference in Japan and we became aware of IT Sherpa at the conference. After that NTQ Solution paid a visit to IT Sherpa's office.","IT_SHERPA_CHANLLENGE_1":"The customer required NTQ Solution to study an existing SNS in one month and after that we had created specifications for the customers. The project requires the newest technologies real-time video call and voice call functionalities.","IT_SHERPA_CHANLLENGE_2":"There were two time-consuming features of the project: the first one was a 'Chat' feature which required managing a huge amount of data at the same time between client and server. The second one was a 'Meet People' feature, ensuring access at a high speed with a large volume of data and complex search conditions. It requires a capability to support a huge number of users up to 100,000 users per day and up to 3 million chat messages every day.","IT_SHERPA_SOLUTION":"About the video and conference call, at the client side we used API of PortSIP and at the server side we used FreeSWITCH. For better performance at the client side we had to handle the image caching to ensure that the application is not slow at some screens which display a large number of images. For better performance of huge data being exchanged every day, we used 3 shading databases. And we also use our own algorithms based on bitwise operators to process data in memory.","IT_SHERPA_RESULT":"NTQ Solution built a complete state of the art Social Network System for IT Sherpa.","SPICY_CINNAMON":"SPICY CINNAMON PTE.LTD","SPICY_CINNAMON_DESC":"Development of photo sharing iOS and Android applications for Spicy Cinnamon Pte. Ltd.","SPICY_CINNAMON_EXPLAIN":"Spicy Cinnamon is a software company based in Thailand specializing in the development of software for interactive digital media. The company was established in 2012 when they came up with the idea of a group photo sharing application. In order to produce this app Spicy Cinnamon needed a software development partner. NTQ Solution was recommended to Spicy Cinnamon who then came to our office in Vietnam and requested us to build the photo sharing app.","SPICY_CINNAMON_CHANLLENGE_1":"The first challenge that arose was a technical requirement related to the processing of continuous uploads of many high quality images.<br>The images were large in size and we had to ensure that the images wouldn't be lost in cases of slow or disconnected Internet connection.","SPICY_CINNAMON_CHANLLENGE_2":"The second challenge was to ensure the app users could view a large number of images on one screen and to make sure the screen worked smoothly without any memory overflow.","SPICY_CINNAMON_SOLUTION_1":"We divided the images into categories of low quality and high quality and prioritized the low quality images","SPICY_CINNAMON_SOLUTION_2":"We used Core Data to handle caching: images are only deleted from cache when it is uploaded successfully","SPICY_CINNAMON_SOLUTION_3":"We used process background uploading to avoid blocking other activities of users","SPICY_CINNAMON_RESULT":"NTQ Solution successfully built for Spicy Cinnamon a complete state-of-the-art group photo sharing iOS and Android apps.<br>Seconds became one of the world's fastest and easiest ways to chat and share photos with friends and families. Seconds application got an Award from SONY at Mobile World Congress in Spain 2013.","SPICY_CINNAMON_SOLUTION_LIST":"We came up with the following solution:","ABOUT_US_TITLE":"<span class=\"text-blue\">About<\/span> us","ABOUT_US_HEADING_1":"<span class=\"text-blue\">who<\/span> are we?","ABOUT_US_EXPLAIN_1":"We were labeled 'crazy' when we decided to separate from a bigger firm to form NTQ Solution.<br>With a clear vision and passionate young workforce we have created a family atmosphere at NTQ which fosters innovation and allows us to strive for technological perfection.<br><br>The name NTQ Solution is a result of hours of deliberation:<br>To our honorable customers NTQ stands for 'Next Top Quality' because providing customers with perfection is our company belief.<br><br>To our workforce NTQ means 'Nha Toi Quan' which literally means 'My Family' because we are not just a company, we are one BIG family.","ABOUT_US_HEADING_2":"<span class=\"text-blue\">What<\/span> we do?","ABOUT_US_EXPLAIN_2":"Here at NTQ we love technology. We do not simply develop basic applications and software. Instead, we carry out thorough investigations and research to provide our customers with the best solutions, both technically and economically.<br><br>At the R&D Centre we have formed a team to develop our own embedded software projects.<br><br>Customers benefit from our services due to the value they will gain from our reasonable costs and the quality of our work. These benefits arise due to our enthusiastic technicians who operate under strict Japanese and Western style operating systems.","ABOUT_US_HEADING_3":"<span class=\"text-blue\">Why<\/span> we are different?","ABOUT_US_EXPLAIN_3":"Firstly, 'Smart Offshore Development' means that NTQ Solution not only provides coding services but also provides solutions, architectural design and detailed design.<br>By offering this array of services we allow our customers to focus on their business needs while we handle the technological aspect of their business.","NTQ_MEMBER_INTRO":"Each of us is completely different, that’s why we are the most versatile","TRAN_VAN_HOANG":"Tran Van Hoang","TRAN_VAN_HOANG_POSITION":"Sales Manager","TRAN_VAN_HOANG_INFO":"I received 3rd prize in an International Mathematical Olympiad when I was in high school. Due to this success I was sponsored by the government to study Computer Science in Australia. I then worked for Nokia in Finland for 3 years before joining NTQ.","TO_HAI_SON":"To Hai Son","TO_HAI_SON_POSITION":"COO","TO_HAI_SON_INFO":"I was sponsored by the Vietnamese government to study Computer Science in Russia. After graduation I worked as a technical leader for FPT Software where I managed projects that were ordered by major Japanese companies. I have over 10 years experience in the Japanese outsourcing market.","PHAM_THAI_SON":"Pham Thai Son","PHAM_THAI_SON_POSITION":"CEO","PHAM_THAI_SON_INFO":"After graduating from Hanoi National University, one of the most prestigious universities in Vietnam, I joined FPT Software. At FPT I worked as a project manager, managing projects that exceeded 300 man months as ordered by major Japanese firms.","NGUYEN_KIM_SOAN":"Nguyen Kim Soan","NGUYEN_KIM_SOAN_POSITION":"CCO","NGUYEN_KIM_SOAN_INFO":"Having been sponsored by the Vietnamese government I decided to study Computer Science in Russia where I graduated as one of the top ten students on my course before finally gaining my MBA in 2011. I have almost 10 years experience working directly with Western and Japanese customers.","TRUONG_DAO_QUY_DUONG":"Truong Dao Quy Duong","TRUONG_DAO_QUY_DUONG_POSITION":"Sales Manager","TRUONG_DAO_QUY_DUONG_INFO":"I lived in Japan for 11 years where I became fluent in Japanese. I graduated from a Japanese graduate school in Public Regional Management before working for a Japanese logistics company. I then began to work for NTQ where I am heavily involved in sales activities related to the Japanese market.","ABOUT_US_VIDEO_INTRO":"Company Introduction","ABOUT_US_VIDEO_DESC":"Established: 13-Jun-2011<br>Human resources: 300 staffs<br>Legal Capital: $250,000<br><br>For more details, please check out this video.","GOALS":"Goals","GOALS_DESC":"STRATEGIC GOALS UNTIL END OF 2021","TOTAL_REVENUE":"Total revenue","REVENUE_VALUE":"Over $20 Millions","HUMAN_RESOURCES":"Human resources","HUMAN_RESOURCES_VALUE":"Over 800 staff","POLICY":"Policy","POLICY_1":"Being a family means \"Solidarity\"","POLICY_2":"Being engineers, we are \"Passionate\"","POLICY_3":"Being partners, we always \"Share\"","MISSION":"Mission","MISSION_1":"We are committed to always providing high quality products and services, and are continuously improving to bring satisfaction to our customers","MISSION_2":"We evoke passion and train programmers to a world class level","PRESS_RELEASES":"Press releases","PRESS_RELEASES_DESC":"We are so happy and proud of this achievement and it provides us with great motivation to continue moving forward","PRESS_RELEASES_EXPLAIN":"On December 6th 2014 VTV4, a Vietnamese science and technology TV channel, interviewed NTQ Solution with regards to the Outsourcing sector. The interview was used as the focal point of the TV program which was broadcast to mark the 40th anniversary of the Vietnam-Japan relationship.<br>We were not chosen by VTV4 because we are a big company but rather because our working principles match both countries' diplomatic relationship standards.<br>We consider this coverage as a reward for the good work we have been doing in the Japanese market.","SOFTWARE_OUTSOURCING_SERVICE_LIST_TITLE":"","SOFTWARE_OUTSOURCING_SERVICE_LIST_ITEM_1":"","SOFTWARE_OUTSOURCING_SERVICE_LIST_ITEM_1_DESC":"","SOFTWARE_OUTSOURCING_SERVICE_LIST_ITEM_2":"","SOFTWARE_OUTSOURCING_SERVICE_LIST_ITEM_2_DESC":"","SOFTWARE_OUTSOURCING_SERVICE_LIST_ITEM_3":"","SOFTWARE_OUTSOURCING_SERVICE_LIST_ITEM_3_DESC":"","FOOTER_MENU_HEADER":"About us","SYSTENA_CUSTOMER_NAME":"","SYSTENA_CUSTOMER_POSITION":"","SYSTENA_CUSTOMER_REVIEW":"","ILOVEX_CUSTOMER_NAME":"","ILOVEX_CUSTOMER_POSITION":"","ILOVEX_CUSTOMER_REVIEW":"","IMYVENUE_CUSTOMER_NAME":"","IMYVENUE_CUSTOMER_POSITION":"","IMYVENUE_CUSTOMER_REVIEW":"","FOOTER_CONTACT_HEADER":"Contact us","TO_EN_VERSION":"Go to English site","TO_JA_VERSION":"日本語","WEBSITE_TITLE":"NTQ Solution | Viet Nam Software Outsourcing Company","RD_LIGHT_CONTROL":"Electronics Lightning System","RD_LIGHT_CONTROL_DESC":"We have developed a mart system which controls home electrical appliances remotely as well as collect sensors' data via internet.","RD_SMART_CARD":"SmartCard","RD_SMART_CARD_DESC":"NTQ Solution JSC and ACT Ltd have collaborated in developing a product call \"ILUTon\", which uses employees' IC cards to check their entrance & exit. It is also used to lock PCs' screens.","navbar_service":"Services","navbar_service-offshore":"Service offshore","navbar_service-ai":"Service AI","navbar_shopify":"Shopify partner","navbar_projects":"Success stories","navbar_rnd":"R&D","navbar_recruitment":"Recruitment","navbar_news":"News","navbar_about":"About us","navbar_contact":"Contact","navbar_download":"Downloads","lang_jp":"Jp","lang_en":"En","company_name":"NTQ Solution","contact_title":"CONTACT US","footer_item_title_1":"Head office in Hanoi","footer_item_address_1":"6th Floor, Sudico Building (HH3), Me Tri Street, Nam Tu Liem District, Hanoi City, Vietnam","footer_item_contact_1":"Tel: (+84) 243 200 8754","footer_item_title_2":"Pham Thai Son","footer_item_address_2":"Chief Executive Officer","footer_item_contact_2":"Email: son.pham@ntq-solution.com.vn","footer_item_title_3":"NTQ Japan","footer_item_address_3":"〒231-0001 6F, Yokohama World Posters Building 2 Chome-2-1 Shinko, Naka Ward, Yokohama, Kanagawa Prefecture, Japan","footer_item_contact_3":"Tel:（+81）45 228 9010","footer_item_title_4":"Ogawa Yoshimitsu","footer_item_address_4":"NTQ Japan CEO","footer_item_contact_4":"Email: yoshi.ogawa@ntq-solution.com.vn","copyright":"Copyright © NTQ Solution 2018","about_title":"About us","ntqvn_table_title":"NTQ Solution.,JSC","ntqvn_label_1":"Company name","ntqvn_content_1":"NTQ Solution.,JSC","ntqvn_label_2":"Head Office","ntqvn_content_2":"6F, Sudico Building, Me Tri Street, Nam Tu Liem District,<br\/>Ha Noi City","ntqvn_label_3":"Phone Number","ntqvn_content_3":"(+84) 243 200 8754","ntqvn_label_4":"Founded","ntqvn_content_4":"June 13, 2011","ntqvn_label_5":"Representative and President","ntqvn_content_5":"Pham Thai Son","ntqvn_label_6":"Capitalization","ntqvn_content_6":"25 million JPY","ntqvn_label_7":"Services","ntqvn_content_7":"Software development, AI development, R & D, technical consultant","ntqvn_label_8":"Number of Employees","ntqvn_content_8":"402 members (by 1\/1\/2019)","ntqvn_label_9":"Certification","ntqvn_content_9":"ISO\/IEC 27001（ISMS：information security management system)","ntqjp_table_title":"Japanese legal entity, NTQ Japan.,JSC","ntqjp_label_1":"Company name","ntqjp_content_1":"NTQ Japan .,JSC","ntqjp_label_2":"Yokohama Office","ntqjp_content_2":"〒231-0001　 6F, Yokohama World Posters Building<br\/>2 Chome-2-1 Shinko, Naka Ward, Yokohama, Kanagawa Prefecture, Japan","ntqjp_label_3":"Phone number","ntqjp_content_3":"(+81) 45-228-9010","ntqjp_label_4":"FAX","ntqjp_content_4":"045-228-9010","ntqjp_label_5":"Founded","ntqjp_content_5":"February 8th, 2016","ntqjp_label_6":"Representative","ntqjp_content_6":"Ogawa Yoshimitsu","ntqjp_label_7":"Capitalization","ntqjp_content_7":"5 million JPY","ntqjp_label_8":"Number of Employees","ntqjp_content_8":"30 members","ntqjp_label_9":"Services","ntqjp_content_9":"Offshore development, SES business","ntqjp_label_10":"Participating Association","ntqjp_content_10":"Kanagawa Information services industry Association（KIA)","about_means_title":"WHO ARE WE?","about_means_desc":"We were labeled 'crazy' when we decided to separate from a bigger firm to form NTQ Solution.<br\/>With a clear vision and passionate young workforce we have created a family atmosphere at NTQ which fosters innovation and allows us to strive for technological perfection.<br\/>The name NTQ Solution is a result of hours of deliberation:<br\/>To our honorable customers NTQ stands for 'Next Top Quality' because providing customers with perfection is our company belief.<br\/>To our workforce NTQ means 'Nha Toi Quan' which literally means 'My Family' because we are not just a company, we are one BIG family.","about_core_title":"Introduction of core members","about_core_name_1":"Tran Van Hoang","about_core_role_1":"Sales Manager","about_core_name_2":"To Hai Son","about_core_role_2":"COO","about_core_name_3":"Pham Thai Son","about_core_role_3":"CEO","about_core_name_4":"Nguyen Kim Soan","about_core_role_4":"CCO","about_core_name_5":"Truong Dao Quy Duong","about_core_role_5":"Sales Manager","about_core_name_6":"Bui Duc Chuong","about_core_role_6":"R&D Manager","about_core_name_7":"Trinh Thi Thu Hien","about_core_role_7":"Senior Manager","about_core_name_8":"Tran Ho Phuong","about_core_role_8":"Vice President","about_core_name_9":"Ogawa Yoshimitsu","about_core_role_9":"Director, Strategic Planning","about_core_name_10":"Pham Thanh Nam","about_core_role_10":"Vice president\/NTQ Japan","about_strategic":"2021 Goal","strategic_1_title":"Total revenue","strategic_1_total":"Over $20 Millions","strategic_1_policy":"Policy","strategic_1_detail_1":"Being a family means 'Solidarity'","strategic_1_detail_2":"Being engineers, we are 'Passionate'","strategic_1_detail_3":"Being partners, we always 'Share'","strategic_2_title":"Human resources","strategic_2_total":"Over 800 staff","strategic_2_policy":"Mission","strategic_2_detail_1":"We are committed to always providing high quality products and services, and are continuously improving to bring satisfaction to our customers","strategic_2_detail_2":"We evoke passion and train programmers to a world class level","strategic_2_detail_3":"As a partner, we deepen mutual understanding.","service-offshore_title":"Service Offshore","service-offshore_define_title":"What is Offshore development?","service-offshore_define_desc":"Offshore is combined by 2 word “off” and “shore” which is used to describe an outsourcing method for taking over in software development, web system, and smartphone app in development and management for a foreign developed company or a foreign subsidiary. In addition, since the factors such as preferential government policy, diverse IT resources, and technical skill, Vietnam has become a rising star in this field.","service-offshore_plan_title":"About offshore development of NTQ","service-offshore_plan_label_1":"Establishment","service-offshore_plan_desc_1":"2011","service-offshore_plan_label_2":"Human resources","service-offshore_plan_desc_2":"402","service-offshore_plan_label_3":"Project number","service-offshore_plan_desc_3":"400+ projects","service-offshore_plan_label_4":"YoY growth","service-offshore_plan_desc_4":"Over 40%","service-offshore_plan_label_5":"Japanese customers","service-offshore_plan_desc_5":"Over 50 companies","service-offshore_about_item_1":"NTQ does not only provides solutions but also apply many years of experience to offer consultancy and alternatives following customer requirement.","service-offshore_about_item_2":"NTQ does not only stop at providing outsourcing service but also adapt to fulfill more and more complex requests of the market.","service-offshore_about_item_3":"Especially, to provide the best service suitable for each customers, we have summarized our experience from more than 400 projects into our working model, NTQ – Way.","service-offshore_how_title":"Work flow","service-offshore_step_title_1":"Requirement discussion","service-offshore_step_notice_1":"(Customer）（Our company)","service-offshore_step_title_2":"Proposal\/Quotation","service-offshore_step_notice_2":"(Customer）（Our company)","service-offshore_step_title_3":"Choosing model","service-offshore_step_notice_3":"(Customer）（Our company)","service-offshore_step_title_4":"Signing contract","service-offshore_step_notice_4":"(Customer）（Our company)","service-offshore_step_title_5":"Starting project","service-offshore_step_notice_5":"(Customer）（Our company)","service-offshore_model_title":"Development model","service-offshore_model_item_1":"Onsite","service-offshore_model_desc_1":"Technical persons will be dispatched to customers, and Vietnamese side will also create a team in charge.","service-offshore_model_item_2":"100% Offshore","service-offshore_model_desc_2":"The development team provides services on the Vietnamese side. BrSE plays an important role as a communicator.","service-offshore_model_item_3":"Customer offshore","service-offshore_model_desc_3":"All development teams will provide services on the Vietnamese side, we will dispatch personnel from Vietnam from our customers and will work together.","service-offshore_advisory":"We always offer free quotes and consultation.<br\/>Contact us today with any questions you may have.","service-offshore_btn_contact":"Contact us","service-ai_title":"Service AI","service-ai_intro_title":"Effective AI application in business","service-ai_intro_desc":"~ Great results from small challenges in Vietnam Offshore ~","service-ai_intro_detail":"AI, one of the emerging technology in today, has surpassed the researching phase and has been adopted in many businesses to increase productivity.<br\/>NTQ is proud to be a company that holds realistic achievement in developing AI for many sectors, and we always support the clients as a reliable partner. To clients who are not specialized in technical domain, we always provide service following the model “offshore research and development + professional expertise” in order to develop customized AI for clients’ business.","service-ai_achievement_1":"Cost efficiency","service-ai_achievement_2":"Improve productivity","service-ai_achievement_3":"Extraordinary funny service","service-ai_feature_title_1":"The AI we developed ourselves:","service-ai_feature_subtitle_1":"Image recognition:","service-ai_feature_item_1_1":"Accuracy: 98%","service-ai_feature_item_1_2":"Increase in productivity: 400%","service-ai_feature_item_1_3":"Use: Detecting issues such as error in products.","service-ai_feature_desc_1":"In addition, the image recognition AI can also be used to monitor video and live streaming.","service-ai_feature_subtitle_2":"Security monitoring camera system:","service-ai_feature_item_2_1":"Doing head count","service-ai_feature_item_2_2":"Detect suspicious action","service-ai_feature_item_2_3":"Recognize registered people","service-ai_feature_subtitle_3":"Classify documents’ content:","service-ai_feature_item_3_1":"Detect the content to classify the documents.","service-ai_feature_item_3_2":"Find related documents","service-ai_feature_item_3_3":"Check chat content","service-ai_feature_item_3_4":"Detect mail spam","service-ai_feature_subtitle_4":"AI Mosaic","service-ai_feature_desc_2":"Before AI, the execution to blur and process image, video classification is done manually which is very time-consuming with low productivity.","service-ai_feature_item_4_1":"Massively increase productivity and cost-efficiency","service-ai_feature_item_4_2":"Easy to blur many parts on demand","service-ai_feature_item_4_3":"Easy to implement","service-ai_feature_title_2":"Joint Development","service-ai_feature_subtitle_5":"Analyze and recommend:","service-ai_feature_desc_3":"Show the products in recommended sector to increase conversion rate:","service-ai_feature_item_5_1":"Effective after 4-5 clicks","service-ai_feature_item_5_2":"Increase in conversion and revenue.","service-ai_feature_item_5_3":"Industrial domains: eCommerce, recruitment, real estates, logistics, matching site.","service-ai_feature_subtitle_6":"AI-OCR","service-ai_feature_item_6_1":"Can recognize Japanese hand-writing","service-ai_feature_item_6_2":"Has high review from BPO companies","service-ai_advisory":"Should there be a need of available AI demos, please don't hestitate to contact us.","service-ai_btn_contact":"Contact us","contact-banner-title":"CONTACT","contact-banner-adress":"Head office in Hanoi","contact-banner-phone":"Phone: (+84) 243 200 8754","contact-content-description":"If you have any questions regarding any of our services then please feel free to contact us. We offer a consultancy service and are eagerly awaiting any questions, estimations or propositions that you may have.","contact-inquiry-title":"Contact us","contact-inquiry-checkbox1":"Download documents","contact-inquiry-checkbox2":"Services","contact-inquiry-checkbox3":"RFI","contact-inquiry-checkbox4":"Other","contact-placeholder1":"Email address","contact-placeholder2":"Name","contact-placeholder3":"Company name","contact-placeholder4":"Phone number","contact-placeholder5":"Contents","btn-circle":"Send","home-banner-content1":"Delivering<br\/>the Next Top Quality Solution","home-banner-content2":"Vietnam Software Outsourcing Company","home-heading1":"Who is NTQ Solution","home-heading2":"NTQ Solution is a Vietnamese software development company providing offshore development services such as mobile and web applications as well as other essential software services for businesses.","btn-japan":"About us","home-heading3":"Why NTQ?","home-reason-item1":"Dedicated team including foreign developer","home-reason-item2":"400+ Projects","home-reason-item3":"24\/7 Quick Response ","home-heading5":"SERVICES","home-service-item1":"Software Outsoucing","home-service-item2":"Besides cost-efficiency, NTQ also takes pride in making a difference in the quality of service.","home-service-item3":"Detail","home-service-item4":"AI research & development","home-service-item5":"NTQ has experience in developing AI in many sectors, our capability is ready to transform ideas into seamless products.","home-service-item6":"Detail","home-service-item7":"Shopify Partner","home-service-item8":"Our dedicated team of Shopify designers and developers help you build and optimize your Shopify store.","home-service-item9":"Detail","home-service-icon1":"Mobile App","home-service-icon2":"Web App","home-service-icon3":"Cloud base software","home-service-icon4":"Medical Software","home-service-icon5":"System Integration","home-service-icon6":"Custom Enterprise Software","home-service-icon7":"Embedded System","home-service-icon8":"E Commerce","home-service-icon9":"AI Recommendation System","home-service-icon10":"AI Image Recognition","home-service-icon11":"AI Optical Character Recognition","home-service-icon12":"RPA","home-heading8":"Testimonial","home-customer-item1":"Masuda Noriyuki","home-customer-item2":"Director, A.C.T Co, Japan","home-customer-item3":"NTQ has many staffs with experience living and working in Japan, they have adopted the Japanese working style and always pay attention to every details, even the minor ones. Mr. Son – the CEO holds big dreams, and he always transmit that energy to set and achieve continuous success with NTQ members.","home-customer-item4":"Masahiro Okabe","home-customer-item5":"Manager, ilovex Co, Ltd, Japan","home-customer-item6":"Developers at NTQ are careful in verifying spec in the initial phase of each project and testing after implementation with high accuracy. I have also found them great at technique and communication on individual level, thus, there is not much unpredictable workload. Furthermore, we can discuss any issues and concern with them, and they are very responsive to provide alternative solutions even for projects that we consider as tough in technical aspect. This is the working style of NTQ.","home-customer-item7":"Dean Sutcliffe","home-customer-item8":"CIO, iMyVenue, Australia","home-customer-item9":"iMyVenue has worked with NTQ on some projects. I have found NTQ technically sound and reliable. The quality of work is of a standard that matches our expectation, an is equal to that of local developers in Australia. They are cost effective and provide smooth solutions for our needs.","home-customer-item10":"Asuka Inoue","home-customer-item11":"CEO, Bit2Byte Inc, Japan","home-customer-item12":"Before doing business with NTQ I felt very worried. However, they have proven to us that they can deliver our specifications to a high standard and NTQ has now become a reliable partner of ours. I have never had a problem with communication with NTQ because they understand the Japanese language and characteristics. I am very glad to have NTQ as a partner as they can provide easy to manage services at reasonable prices.","home-heading9":"Technical Capabilities","home-heading10":"In order to elevate the comprehensive competitiveness for our clients, we always provide the newest and cutting-edge technology.","home-heading11":"CLIENTS UNDER TRANSACTION","home-heading12":"NTQ is on a journey around the world","home-heading13":"RESEARCH & DEVELOPMENT","home-heading14":"In addition of providing outsourcing service, we also do research & development for products. We will transform your dream into reality with execution.","home-btn-view-more":"Read more >>","home-news-item_day1":"2018.8.10","home-news-item1":"GDC Technology様とのご協力","home-news-item_day2":"2018.8.10","home-news-item2":"3年連続のサミットデー","home-news-item_day3":"2018.8.10","home-news-item3":"2019年のカレンダー","home-news-item_day4":"2018.8.10","home-news-item4":"エネルギーアップの秋","home-news-item_day5":"2018.8.10","home-news-item5":"NTQ主催のAIセミナー","recruitment-introduce-title1":"Recruitment","recruitment-introduce-content1":"NTQ Solution là Công ty hoạt động trong lĩnh vực gia công phần mềm cho các thị trường Nhật Bản (với tỷ trọng hơn 80%) , Hàn Quốc, Singapore, Úc, Phần Lan... với quy mô hiện tại là gần 300 thành viên<br>Một trong các mục tiêu của NTQ trong thời gian tới là trở thành Công ty toàn cầu và tăng thị phần tại thị trường Nhật Bản, mục tiêu đạt con số 1000 member vào năm 2021.<br>Hiện tại chúng tôi đang tuyển dụng những vị trí sau","recruitment-introduce-title2":"Chính sách tuyển dụng","recruitment-introduce-content2":"Với sự cạnh tranh ngày càng khốc liệt của thị trường lao động ngành CNTT, để có thể tạo lập giá trị và sự tin tưởng tuyệt đối vào công ty, NTQ Solution chú trọng việc xây dựng, triển khai chính sách để đảm bảo xây dựng một nội bộ vững chắc, chuyên nghiệp và mang lại nhiều lợi ích cho thành viên công ty – được coi là yếu tố hàng đầu trong tổ chức. Chính sách rõ ràng không chỉ giúp tăng năng suất và hiệu quả làm việc của nhân viên mà còn làm tăng mức độ gắn kết nhân viên, giúp họ gắn bó lâu dài với tổ chức. Dưới đây là một số chính sách nổi bật mà NTQ đang áp dụng cho toàn thể các thành viên trong công ty:<br \/><br \/>1\/ Khuyến khích học tập và đào tạo: “Học, học nữa, học mãi”, học để không ngừng phát triển và đi đến thành công. NTQ Solution chú trọng tổ chức các chương trình training on job, seminar thường xuyên về chuyên môn, cập nhật các kiến thức công nghệ mới nhất. Có Chính sách phát triển năng lực quản lý, xây dựng đội ngũ kế thừa, đào tạo các kỹ năng làm việc nhằm nâng cao kiến thức, kỹ năng, xây dựng đội ngũ ngày càng lớn mạnh.<br>Đồng thời thúc đẩy năng lực tự học và rèn luyện theo định hướng nghề nghiệp và phù hợp với sở trường của từng thành viên. Tiến hành khen thưởng, tăng lương và hoàn tiền thi chứng chỉ chuyên môn, ngoại ngữ.<br \/>1\/ Khuyến khích học tập và đào tạo: “Học, học nữa, học mãi”, học để không ngừng phát triển và đi đến thành công. NTQ Solution chú trọng tổ chức các chương trình training on job, seminar thường xuyên về chuyên môn, cập nhật các kiến thức công nghệ mới nhất. Có Chính sách phát triển năng lực quản lý, xây dựng đội ngũ kế thừa, đào tạo các kỹ năng làm việc nhằm nâng cao kiến thức, kỹ năng, xây dựng đội ngũ ngày càng lớn mạnh.<br>Đồng thời thúc đẩy năng lực tự học và rèn luyện theo định hướng nghề nghiệp và phù hợp với sở trường của từng thành viên. Tiến hành khen thưởng, tăng lương và hoàn tiền thi chứng chỉ chuyên môn, ngoại ngữ.<br \/>1\/ Khuyến khích học tập và đào tạo: “Học, học nữa, học mãi”, học để không ngừng phát triển và đi đến thành công. NTQ Solution chú trọng tổ chức các chương trình training on job, seminar thường xuyên về chuyên môn, cập nhật các kiến thức công nghệ mới nhất. Có Chính sách phát triển năng lực quản lý, xây dựng đội ngũ kế thừa, đào tạo các kỹ năng làm việc nhằm nâng cao kiến thức, kỹ năng, xây dựng đội ngũ ngày càng lớn mạnh.<br>Đồng thời thúc đẩy năng lực tự học và rèn luyện theo định hướng nghề nghiệp và phù hợp với sở trường của từng thành viên. Tiến hành khen thưởng, tăng lương và hoàn tiền thi chứng chỉ chuyên môn, ngoại ngữ.","recruitment-see-more":"Xem thêm","recruitment-feel-title":"Cảm nhận của NTQER","recruitment-feel-name1":"Nguyễn Thị Quyên","recruitment-feel-job1":"Tester","recruitment-feel-detail1":"NTQ là một môi trường năng động, trẻ trung và tạo dựng cho mình một phong cách làm việc mới, một lối tư duy mới. Không những thế, với phong trào học tập - tự học tập vô cùng mạnh mẽ, tại đây mình đã có cơ hội học hỏi thêm rất nhiều kiến thức mới. NTQ đã giúp mình nhận ra được giá trị thực sự của bản thân và tạo được động lực để mình cố gắng hơn mỗi ngày, cuộc sống vì thế sẽ trở nên hấp dẫn và thú vị, ý nghĩa hơn rất nhiều.","recruitment-feel-name2":"Phạm Thị Hường","recruitment-feel-job2":"Tester","recruitment-feel-detail2":"Điều khiến mình quyết định gắn bó với NTQ đó chính là môi trường chuyên nghiệp, đặc biệt có rất nhiều anh chị giàu kinh nghiệm và luôn sẵn sàng giúp đỡ. Tại đây, mình đã học hỏi được về quy trình làm việc chuyên nghiệp, học hỏi được cách sắp xếp công việc cũng như phân bố thời gian hợp lí, đưa ra công việc cần làm và cố gắng hoàn thành nó thật tốt. Bên cạnh đó, NTQ cũng thường xuyên có những hoạt động văn hóa tinh thần khác, rất phù hợp với một con người năng động, hướng ngoại và thích tham gia hoạt động như mình.","recruitment-feel-name3":"Lưu thị diệu ánh","recruitment-feel-job3":"Đào tạo","recruitment-feel-detail3":"Môi trường trẻ và vô cùng vui vẻ. Từ các sếp cho đến nhân viên, mọi người đều rất vui vẻ và thân thiện. Không chỉ được làm đúng công việc, chuyên môn mình mong muốn, tại đây, mình còn được thỏa sức sáng tạo để giải quyết các vấn đề, thiết kế và làm quen với các vấn đề chiến lược nên học được cách làm việc độc lập, làm việc nhóm và cách tư duy logic để giải quyết các vấn đề. Mình nghĩ đây là một môi trường rất phù hợp để phát triển, đặc biệt là các bạn trẻ tuổi như mình.","recruitment-feel-name4":"Trần Đức Huy","recruitment-feel-job4":"Dev","recruitment-feel-detail4":"Mỗi ngày trôi qua là 1 ngày mình lại có thêm những bài học, những kiến thức mới. Đó không chỉ là kỹ năng nghề nghiệp mà còn là kinh nghiệm sống và làm việc. Ở NTQ ai cũng có thể là người thầy của bạn dưới 1 góc độ nào đó. Có thể không cùng dự án, không cùng đơn vị, miễn là bản thân chịu học hỏi, chịu cố gắng thì bất kể ai cũng sẽ sẵn sàng giúp đỡ bạn.","recruitment-feel-name5":"Từ bình minh","recruitment-feel-job5":"Comtor","recruitment-feel-detail5":"NTQ luôn chào đón và tạo điều kiện cho các thành viên trẻ tuổi, ngay cả những thành viên chưa ra trường. Chỉ cần có đam mê, chăm chỉ và cầu tiến, các bạn hoàn toàn có thể trở thành một nhân viên chính thức và không thua kém ai cả. Đó chính là động lực và cũng là niềm tin để mình tiếp tục cố gắng phát triển bản thân nhiều hơn nữa.","recruitment-feel-name6":"Nguyễn Duy Tùng","recruitment-feel-job6":"Dev","recruitment-feel-detail6":"Môi trường thân thiện, chuyên nghiệp và các sếp luôn tạo điều kiện để cho thành viên được phát triển là điều đã giữ chân mình tại NTQ. Hơn nữa, điều mình thấy ấn tượng nhất sau một thời gian làm việc đó là sự chủ động trong công việc của các nhóm dự án. Không chỉ thực hiện theo đúng yêu cầu của khách hàng mà còn thường xuyên đề xuất phương án cải thiện sản phẩm một cách tốt nhất. Chính điều này đã khiến khách hàng rất tin tưởng với đội ngũ của công ty.","recruitment-news-title":"Bản tin tuyển dụng","recruitment-news_item-title1":"Tuyển dụng web developer fullstack","recruitment-news_item-time1":"18\/7\/2018","recruitment-news_item-description1":"Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam","btn-loadmore":"Xem tin","recruitment-news_item-title2":"Tuyển dụng C++, C#","recruitment-news_item-time2":"18\/7\/2018","recruitment-news_item-description2":"Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam","recruitment-news_item-title3":"Tuyển dụng Java developer","recruitment-news_item-time3":"18\/7\/2018","recruitment-news_item-description3":"Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam","recruitment-news_item-description4":"Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam,","recruitment-news_item-title4":"Tuyển dụng C++, C#","recruitment-news_item-time4":"18\/7\/2018","recruitment-news_item-time4-541995144599486b239e86a4c3ad2cfd":"Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam","oll-news":"tin cũ","news":"tin mới","research-dev_banner-title":"RESEARCH & DEVELOPMENT","research-dev_introduce-title":"WHY R&D?","research-dev_introduce-description":"We develop by ourselves to pursuit the dream.","research-dev_introduce-reason__title1":"1. TO GAIN FURTHER INSIGHT INTO THE TECHNOLOGIES WE USE","research-dev_introduce-reason_description1":"Our R&D department aim to learn more about the technology NTQ operates with in order to enhance our technological capabilities.","research-dev_introduce-reason__title2":"2. TO SUPPORT DEVELOPMENT TEAMS","research-dev_introduce-reason_description2":"Our R&D department is not an independent department. The R&D team members are often asked to support our client’s projects. Their technological capabilities and knowledge have proven vital in the successful completion of some difficult projects.","research-dev_contact_title":"For those interested in our R&D, feel free to contact us.","research-dev_contact_description":"We are currently looking for partner in joint venture who can collaborate and support us with our present, and future, projects.","research-dev_contact__btn":"Contact Us","research-dev_team-title":"CRAZY TEAM","research-dev_team-description":"Our R&D employees are labeled the ‘Crazy Team’ due to their ability to think of innovative ideas for projects.","research-dev_video-title1":"Joint Development","research-dev_video-title2":"Own development","project-banner-title":"SUCCESS STORIES","project-description-title":"お客様の声","project-content-detail1":"The staff at NTQ are very dynamic as shown in their ability to simultaneously create a fun atmosphere while being productive. In terms of quality, they have captured the Japanese psyche and have produced good software products. Our company has luckily found a good partner in NTQ Solution.","project-content-detail2":"Sometimes our projects require us to create deliverables and produce documents written in English. In Japan it is hard to find engineers who can understand English, making it difficult to control costs and the speed at which a project is completed. NTQ Solution solved this problem for us through their excellent communication skills.","project-content-detail3":"Before doing business with NTQ I felt very worried. However, they have proven to us that they can deliver our specifications to a high standard and NTQ has now become a reliable partner of ours. I have never had a problem with communication with NTQ because they understand the Japanese language and characteristics. I am very glad to have NTQ as a partner as they can provide easy to manage services at reasonable prices.","project-content-detail4":"NTQ has a team of engineers and technology experts who have many working experience in Japan that bring customers reliable feeling because of Japan working style and care about each small thing.<br\/>Pham Thai Son – CEO is a people who have huge passion about technology and he recruits plenty of talented and passionate employees. In fact, although NTQ is developing with fast speech, but the company is still maintain core value.<br\/>NTQ is a reputable company that I want introduce in Vietnam.","project-achievement-title":"Example about App – Implement projects","project-achievement-subtitle1":"Co-Lab","project-achievement-name1":"Glas","project-achievement-name2":"Framework","project-achievement_list-item1":"The client is building more than 10 types of SNS dating services.","project-achievement_list-item2":"The number of users has reached 2 million users.","project-achievement_list-item3":"The goal is to seek out a reliable partner to delegate the development of system in order to focus on other business’ aspects.","project-achievement-name3":"Result","project-achievement_list-item4":"Glas and NTQ has collaborated for 5 years.","project-achievement_list-item5":"NTQ takes responsibilities in development and maintenance for 5 types of services.","project-achievement_list-item6":"Reconstruct the system to adapt with the need of expanding service.","project-achievement_list-item7":"Current team size: 100 Man month","project-achievement-name4":"Canbus System","project-achievement-name5":"Framework","project-achievement-name_p1":"Building a cloud-based online data management system based on multi-tenant model for enterprise customers.","project-achievement-name_p2":"This system provides functions as a database and gives users authority to manage, share and analyze data.","project-achievement-name6":"Main functions","project-achievement_list-item8":"User defines data through application","project-achievement_sublist-item1":"The user defines the data structure","project-achievement_sublist-item2":"The user designs the data input form","project-achievement_sublist-item3":"The user defines the data display mode","project-achievement_list-item9":"Manage data of application processing flow","project-achievement_sublist-item4":"Users can define data processing flows and assign and authorize data processing","project-achievement_sublist-item5":"Users can automate data processing flow","project-achievement_list-item10":"Collaborative functions","project-achievement_sublist-item6":"With the workspace function, multiple users can collaborate as one team.","project-achievement_sublist-item7":"Provide messaging and forum functions between teams","project-achievement-name7":"Result","project-achievement_list-item11":"Project size: 200 Man month","project-achievement_list-item12":"Our scope of work: specification definition → coding → integration test","project-achievement-subtitle2":"Ope-Lab","project-achievement-name8":"DQS Labo","project-achievement-name9":"Framework","project-achievement_list-item13":"Client want to develop a system to support creating proposals for stores in ASEAN.","project-achievement_list-item14":"NTQ was assigned to develop and maintain the system, as well as handling upgrade, function change request throughout operating.","project-achievement_list-item15":"Even while in use it is required to respond to the actual situation by upgrading, changing functions, etc.","project-achievement-name10":"Result","project-achievement_list-item16":"To maintain the system, the client ordered a Ope Lab with 2 Man per month.","project-achievement_list-item17":"The offshore team has been supervising the server and handling occurring issues.","project-achievement-name11":"Community","project-achievement-name12":"Framework","project-achievement_list-item18":"Client has been providing dating service based on web for 6 companies and expect NTQ to take care of all of the workload.","project-achievement_list-item19":"Maintaining content:","project-achievement_sublist-item8":"Monitor the condition of the service and service in the system. Fast responsive for any arising issues.","project-achievement_sublist-item9":"Proceed the maintenance such as backup, log removal, etc…","project-achievement_sublist-item10":"Taking care of the change when the system updates service provider such as Email, advertisement, invoice, etc…","project-achievement_sublist-item11":"In charge of some tasks in system management such as change in catalogue (edit\/add\/delete catalogue, email template), etc…","project-achievement_sublist-item12":"Edit\/update text, image, banner, URL for website according to client’s request.","project-achievement-name13":"Result","project-achievement_list-item20":"Allocate a maintenance team (dev + comtor)","project-achievement_list-item21":"The team has been operating for more than 3 years.","project-achievement-subtitle3":"S-Lab","project-achievement-name14":"Trb Labo","project-achievement-name15":"Framework","project-achievement_list-item22":"Client is a digital agency from Singapore with expertise in Digital Content Marketing","project-achievement_list-item23":"The client is doing business in website development so that they have high requirement for design for impression to users.","project-achievement_list-item24":"Client wants to find a reliable partner that fits these conditions. ","project-achievement-name16":"Result","project-achievement_list-item25":"The original development team started off with 2 members and increased to 7 members in 6 months.","project-achievement_list-item26":"The offshore development team has been in charge of processing HTML\/CSS and creating animation following client’s requests.","project-achievement_list-item27":"In addition, NTQ has also been in charge of the backend.","project-achievement-name17":"MM Labo","project-achievement-name18":"Framework","project-achievement_list-item28":"Client is in Japan and want to provide advertising website for end-users.","project-achievement_list-item29":"Despite their desire to expand business, client face difficulty in recruitment as the salary rate in Japan is fairly high.","project-achievement_list-item30":"Client wants to seek suitable resource for business expansion.","project-achievement-name19":"Result","project-achievement_list-item31":"The development team took 3 months to adopt the service quality for advertising website.","project-achievement_list-item32":"The team has increased from 2 members to 5 members.","project-achievement_list-item33":"Client also delegate UI\/UX task for NTQ. ","project-achievement-subtitle4":"PoC-Lab","project-achievement-name20":"SSO","project-achievement-name21":"Framework","project-achievement_list-item34":"Client is an enormous electronic manufacturer with approximately 30.000 employees. They usually use many internal enterprise systems.","project-achievement_list-item35":"Client wants to develop a system that can automatically login into every systems to save time.","project-achievement_list-item36":"Client worries about technical aspect of this project.","project-achievement-name22":"Result","project-achievement_list-item37":"NTQ completed a demo for this system through extension\/plugin of browser (20 Man Month effort)","project-achievement_list-item38":"The project continues into the next phase with 36 Man month","project-achievement_list-item39":"All staff have been using this system after complete development.","project-achievement_list-item40":"NTQ continues to maintain this system.","project-achievement-name23":"Syminar","project-achievement-name24":"Framework","project-achievement_list-item41":"Client is a start-up company in building online LMS using live streaming.","project-achievement_list-item42":"In order to attract end-users and investors, client needs a demo for minimized functions.","project-achievement_list-item43":"The live streaming needed to be built on Opensource platform. However, in order to fit the project timeline, we have developed a demo on platform with subscription fee.","project-achievement-name25":"Result","project-achievement_list-item44":"In 2 months, NTQ completed the demo for platform livestreaming.","project-achievement_list-item45":"The system was designed to fit with Tokbox platform, as well as the paid platform.","project-achievement_list-item46":"The client has sold this service for 2 businesses.","project-achievement_list-item47":"At the moment, the system has been extended into Co-lab with 5 members.","project_advisory":"We always offer free quotes and consultation. Contact us today with any questions you may have.","project_advisory-btn":"Contact us","landing-baner_detail":"At NTQ Solution, our dedicated team of Shopify designers and developers build customised, enterprise solutions for fast growing, high volume merchants. With offices in Sydney and Melbourne, we specialise in multi-channel retail and work with some of Australias leading brands. WithShopify Plus, your business is guaranteed seamless growth and scalability.","landing-baner_detail1":"Our core value is to create profitable eCommerce business for our clients. Whether you’re starting small or scaling up, we provide strategy, design and growth services to maximise your commerce.","landing-why_shopify_title":"Why shopify","landing-why-shopify_title_detail":"Everything's handled","landing-why-shopify_title_detail1":"Mobile app and shopify Pos","landing-why-shopify_title_detail2":"robust app marketplace","landing-why-shopify_title_detail3":"cross channel selling","landing-why-shopify_title_detail4":"endless customization","landing-why-shopify_detail":"Concentrate on growing your business. Shopify has everyhing built-in and taken care of by professionals. Your store will be fast, secure, and taken care of.","landing-why-shopify_detail1":"Take your business everywhere with the mobile app, or seamlessly grow into a robust point of sale system to power your retail locations.","landing-why-shopify_detail2":"There's always an app for that. With over 1,800 apps in the App Store, we use them to power everything from email marketing to accounting integration.","landing-why-shopify_detail3":"Your online store is only one of the channels available for you to sell on. Sell on Facebook, Amazon, Ebay, and Buzzfeed ? with more channels being added all of the time.","landing-why-shopify_detail4":"If you can think it, we can build it. Shopify's liquid language lets us create beautiful responsive websites that will create a lasting impression.","landing-service-title":"Our Shopify Service","landing-service-item--title1":"Platform migration","landing-service-item--title2":"Start a store","landing-service-item--title3":"Managed services","landing-service-item-content1":"Take your performance to the next level with our re-platform services to Shopify and Shopify Plus.","landing-service-item-content2":"We take care of everything from start to launch so you can focus on building your business. Our Shopify developers take the beautiful work done by our designers and bring it to life. It's our job to build dazzling sites without sacrificing functionality or speed.","landing-service-item-content3":"Regardless of the size of your project, whether it be small design work or an ongoing project that requires monthly support, NTQ can shape up your venture to make it a fruitful experience that will improve your eCommerce business.","landing-ready-title":"Ready to get your Shopify store?","landing-ready-detail":"Send us a message and we'll get back to you as soon as possible","landing-ready-btn":"Get in touch","download":"Downloads","download-description1":"To discover more about NTQ Solution please feel free to download the materials listed below.","download-description2":"Check out our portfolios to explore the high quality work we have done in the past.","download-item-content1":"NTQ-Solution_.NET Project Portfolio","download-item-content2":"NTQ-Solution_Web Project Portfolio","download-item-content3":"NTQ-Solution_iOS Project Portfolio","download-item-content4":"NTQ-Solution_Company Portfolio","download-item-content5":"NTQ-Solution_Company Profile","download-item-content6":"NTQ-Solution_Company Profile (Korean)","download-content_item-title":"Company Profile and Actual Material","download-content-item-title":"Contract sample","download__item-content1":"NTQ-Solution_NDA_ENG_Sample","download__item-content2":"NTQ-Solution_Contract_EN_Sample","download__item-content3":"NTQ-Solution_WorkOrder_EN_Sample","download-content_item-title-37e2429c0db314ac6532db4d0acd9c97":"Company Profile and Actual Material (Japanese version)","download-item-content4-057168bfc674f2ba4bc72676586e8428":"NTQ-Solution_.NETプロジェクト実績資料","download-item-content5-1586e15e0b031e8c279fb5164c410c1f":"NTQ-Solution_ウェブプロジェクト実績資料","download-item-content6-489369c7400e23cd122a59cd3939095a":"NTQ-Solution_iOSプロジェクト実績資料","download-item-content7":"NTQ-Solution_Androidプロジェクト実績資料","download-item-content8":"NTQ-Solution_開発事例資料","download-item-content9":"NTQ-Solution_会社プロファイル資料","download-content_item-title3":"Contract sample (Japanese version)","download-item-content10":"NTQ-Solution_機密保持契約書","download-item-content11":"NTQ-Solution_業務委託基本契約書","download-item-content12":"NTQ-Solution_ラボ契約_業務委託基本契約書","download-item-content13":"NTQ-Solution_請負契約_業務委託基本契約書","download-content_item-title4":"Company Profile and Actual Material (KOR ver)","download-item-content14":"NTQ-Solution_.NETプロジェクト実績資料","download-item-content15":"NTQ-Solution_ウェブプロジェクト実績資料","download-item-content16":"NTQ-Solution_iOSプロジェクト実績資料","download-item-content17":"NTQ-Solution_Androidプロジェクト実績資料","download-item-content18":"NTQ-Solution_開発事例資料","download-item-content19":"NTQ-Solution_会社プロファイル資料","download-content_item-title5":"Contract sample (KOR ver)","download-item-content19-cd2636d224ced668d7fe6f66c6ab82cc":"NTQ-Solution_機密保持契約書","download-item-content19-a97ed12c583b497a4ffcc42b1052a18b":"NTQ-Solution_業務委託基本契約書","download-item-content19-7977c7476740125297aefa5dd8040e8f":"NTQ-Solution_ラボ契約_業務委託基本契約書","download-item-content19-82301ba42bd029aed35f22739c7276ca":"NTQ-Solution_請負契約_業務委託基本契約書","download-modal-title":"Type your E-mail to download","download-btn":"Download"}
